[
    {
        "title": "IT: Welcome to Derry",
        "description": "A prequel to It, set in the 1960s, telling the origins of Pennywise the clown.",
        "rating": 8.2,
        "realiseDate": "2025-10-26T00:00:00.000Z",
        "genres": [
            "Horror",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/27/b21e2a874e9fasq42n49b.jpg",
        "watchUrl": "https://hdrezka.ag/series/horror/79810-ono-dobro-pozhalovat-v-derri-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "Tron: Ares",
        "description": "Continuation of the story about the cyberverse, where virtual people with real feelings live, a dictatorship reigns and gladiator fights take place.The return of an old opponent starts the game according to new rules.",
        "rating": 6.7,
        "realiseDate": "2025-10-06T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Action",
            "Adventures",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/5/qe534e44c98f4qm81k20l.jpg",
        "watchUrl": "https://hdrezka.ag/films/fiction/78696-tron-ares-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "A House of Dynamite",
        "description": "When a single missile with no purpose is fired at the United States, a race begins to determine who is responsible and how to respond.",
        "rating": 6.7,
        "realiseDate": "2025-09-02T00:00:00.000Z",
        "genres": [
            "Thrillers",
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/24/a4b094088f2deyg83q29b.jpg",
        "watchUrl": "https://hdrezka.ag/films/thriller/83122-dom-iz-dinamita-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Anemone",
        "description": "For many years now, former British Army soldier Ray Stoker has lived the life of a hermit in a primitive hut deep in the forest, where he hunts for food, washes his clothes in the river and exercises to keep fit.He also cut off all ties with his family: his wife Nessa and son Brian have been looked after by his devout brother Jem all this time.When his grown-up son gets into trouble and needs his father's support, his wife and brother look for a way to convince Ray to come.The man would be glad to return, but he can’t forgive himself for what he did 20 years ago...",
        "rating": 5.8,
        "realiseDate": "2025-10-03T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/4/kda24190abe27oq94z72c.jpg",
        "watchUrl": "https://hdrezka.ag/films/drama/82562-anemon-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Long Walk",
        "description": "Future.The country hosts an annual Long Walk competition in which fifty young men compete.The participants' task is to complete a multi-kilometer route at a speed above three miles per hour; after three violations, the participant is eliminated.The main prize is a large sum of money and the fulfillment of a wish.",
        "rating": 7.1,
        "realiseDate": "2025-09-11T00:00:00.000Z",
        "genres": [
            "Horror",
            "Thrillers",
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/26/ia994eb794850bd93n67p.jpg",
        "watchUrl": "https://hdrezka.ag/films/horror/79458-dolgaya-progulka-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Roses",
        "description": "The plot centers on the happy and prosperous British Rose family, living on the picturesque coast in Northern California.Theo is a successful architect, and Ivy, who gave up her career as a chef, is focusing on raising her two twin children.The family's life is turned upside down when Theo loses his job and is forced to look after the children, and Ivy experiences a rapid professional rise after opening a small beach restaurant.Almost immediately, fierce rivalry breaks out between the spouses, revealing long-standing grievances.",
        "rating": 6.9,
        "realiseDate": "2025-08-27T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/27/md70ca8fd095fuy22t67s.jpg",
        "watchUrl": "https://hdrezka.ag/films/comedy/79003-suprugi-rouz-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Murdaugh: Death in the Family",
        "description": "Married couple Maggie and Alex Murdaugh enjoy a luxurious life in South Carolina.This is one of the most influential and powerful families in the state, because Alex is a successful lawyer who continued the family dynasty.But the situation changes when their son Paul becomes the accused.The investigation claims that he is guilty of the death of a passenger on his motor boat.He drove the boat while intoxicated and caused an accident.As the facts are examined, it turns out that this is not the only death in which the Murdos may be involved.To prevent the case from being hushed up, Mandy Matney hosts the Murdo Murders podcast, conducts her own investigation and shares the facts.The further the proceedings progress, the more unsightly facts about this family become known to the public.",
        "rating": 7.1,
        "realiseDate": "2025-10-15T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Detectives",
            "Thrillers",
            "Crime",
            "Biographical",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/2/nec45338a9df8ic55m86j.jpg",
        "watchUrl": "https://hdrezka.ag/series/drama/82528-merdo-smert-v-seme-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "A Big Bold Beautiful Journey",
        "description": "In this story, David goes to a wedding in his old car with a unique GPS.He meets Sarah and together they go on a journey suggested by GPS.Along the way, they confront their past and explore painted landscapes, leading to a deeper connection.As they contemplate their future, they are faced with an important decision regarding their relationship.",
        "rating": 6.1,
        "realiseDate": "2025-09-17T00:00:00.000Z",
        "genres": [
            "Adventures",
            "Fantasy",
            "Melodrama",
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/14/u919d44fbae97mt50o77j.jpg",
        "watchUrl": "https://hdrezka.ag/films/adventures/80021-bolshoe-smeloe-krasivoe-puteshestvie-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Good Boy",
        "description": "Todd, who suffers from a chronic respiratory disease and, due to his deteriorating health, decides to move from New York to a secluded country house in the woods that once belonged to his grandfather.The man is accompanied by a faithful dog named Indy, whom he adopted as a small puppy.Soon after moving in, the pet begins to notice evil otherworldly forces constantly watching Todd from the shadows.The dog cannot warn its owner about the danger, so it must independently resist the supernatural presence.",
        "rating": 6.4,
        "realiseDate": "2025-03-08T00:00:00.000Z",
        "genres": [
            "Horror",
            "Thrillers",
            "Comedy",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/11/kc6cf10043982pf53n82a.jpg",
        "watchUrl": "https://hdrezka.ag/films/horror/82731-glazami-psa-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Woman in Cabin 10",
        "description": "London-based investigative journalist Laura Blacklock, who works for The Guardian, needs a break after a professional tragedy.She becomes a passenger on the luxury cruise yacht Aurora, which sets off on its first three-day voyage to the Norwegian fjords, where a charity gala dinner is to be held.Late at night, Laura hears screams and sounds of struggle from the next cabin, and then sees a body falling overboard.Since no one takes the journalist’s words seriously, she undertakes an independent investigation, which puts her life in mortal danger.",
        "rating": 5.9,
        "realiseDate": "2025-10-10T00:00:00.000Z",
        "genres": [
            "Thrillers",
            "Dramas",
            "Detectives",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/28/x61117f4f65b7zn30h94f.jpg",
        "watchUrl": "https://hdrezka.ag/films/thriller/81728-devushka-iz-kayuty-10-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Freakier Friday",
        "description": "Two decades after the body-swap incident, a grown-up Anna, working as a music producer, is single-handedly raising her high school daughter Harper.The woman is helped in this by her own mother Tess, who is still a successful psychotherapist and writer.Having met the charming single father Eric at a parent meeting, six months later Anna is preparing for her wedding, unaware that their daughters are sworn rivals at school.On the eve of the unification of two families, the story of the exchange of bodies is repeated on a double scale.",
        "rating": 6.6,
        "realiseDate": "2025-07-22T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Fantasy",
            "Family",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/5/o05d7221135f3cl66f97q.jpg",
        "watchUrl": "https://hdrezka.ag/films/comedy/79188-chumovaya-pyatnica-2-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Conjuring: Last Rites",
        "description": "In 1986, due to deteriorating health, Ed Warren and his wife Lorraine were forced to virtually abandon the study of paranormal phenomena, concentrating on lecturing at colleges.Their 22-year-old daughter Judy, who has inherited psychic abilities, begins to suffer from terrifying visions, prompting her to begin a fight against the demonic forces that terrorize the large Smurl family.Ed and Lorraine step in to help when it becomes clear that the culprit is an old cursed mirror, which they had already dealt with many years ago, but then failed.",
        "rating": 6.3,
        "realiseDate": "2025-09-03T00:00:00.000Z",
        "genres": [
            "Horror",
            "Detectives",
            "Thrillers",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/2/f4c91d48ec88dsd24k65u.jpg",
        "watchUrl": "https://hdrezka.ag/films/horror/79460-zaklyatie-4-posledniy-obryad-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Lost Bus",
        "description": "The action takes place in November 2018 in the city of Paradise in Northern California, where there has not been a drop of rain for 210 days.44-year-old Kevin McKay, a newly hired school bus driver, is dealing with a life crisis involving his recently deceased father, a divorce, an ill mother, a difficult relationship with his teenage son, and a mountain of unpaid bills.When the town is caught in an unprecedented wildfire, Kevin, seeking a chance to atone for his life's mistakes, defies dispatch orders to evacuate 22 children and schoolteacher Mary to safety.",
        "rating": 7.0,
        "realiseDate": "2025-09-19T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Thrillers",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/7/29/f7cb65541062fdg51r19k.jpg",
        "watchUrl": "https://hdrezka.ag/films/drama/81169-shkolnyy-avtobus-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Play Dirty",
        "description": "Shortly before Christmas, professional thief Parker and his team pull off a robbery at a racetrack that doesn't go according to plan when one of her accomplices, named Zen, shoots everyone and makes off with the loot.Parker, who miraculously survived, is on the trail of the traitor, but does not dare to kill her, since she used the stolen money to prepare a much larger robbery.The two assemble a new team to try to rob a Latin American dictator who has recently recovered the treasure from a sunken 15th-century Spanish galleon worth a billion dollars from the bottom of the sea.",
        "rating": 5.9,
        "realiseDate": "2025-10-01T00:00:00.000Z",
        "genres": [
            "Action",
            "Dramas",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/27/ffeef0a58fc7ekk46o42x.jpg",
        "watchUrl": "https://hdrezka.ag/films/action/81723-gryaznaya-igra-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Caught Stealing",
        "description": "The story takes place in the late 1990s in New York and revolves around Hank Thompson, a once-promising baseball player who was forced to abandon his sports career after a car accident.He works as a bartender in a seedy bar, often drinks heavily and spends time in the company of his cute girlfriend Yvonne, who wants a serious relationship.Once he agrees to look after the pet cat of his London punk neighbor Russ, the protagonist unwittingly becomes involved in hair-raising criminal misadventures that turn his life upside down.",
        "rating": 7.1,
        "realiseDate": "2025-08-27T00:00:00.000Z",
        "genres": [
            "Thrillers",
            "Crime",
            "Comedy",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/7/14/ic3f7e4f2c39ete23r70i.jpg",
        "watchUrl": "https://hdrezka.ag/films/thriller/79790-poyman-s-polichnym-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "House of Guinness",
        "description": "In May 1868, the famous Irish brewer and philanthropist Benjamin Lee Guinness dies.The funeral procession in Dublin is accompanied by demonstrations from two groups of violent protesters: temperance supporters and revolutionaries opposed to Guinness's close relationship with the British government.Meanwhile, four adult heirs begin to compete with each other for the right to lead the beer empire: the eldest son Arthur, who recently returned from London, Ben, who suffers from a gambling addiction, the hardworking Edward and the only daughter Anne.",
        "rating": 7.5,
        "realiseDate": "2025-09-25T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Biographical",
            "Historical",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/1/l3c7bc25a7a1dgb39a94v.jpg",
        "watchUrl": "https://hdrezka.ag/series/drama/81798-dom-ginnessa-2025.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "The Lowdown",
        "description": "Lee Raybon is a citizen journalist and self-proclaimed anti-corruption crusader who owns an unprofitable used bookstore in Tulsa, Oklahoma.His habit of minding his own business regularly lands him in trouble, but he also tries to be a good father to his teenage daughter Frances, sharing custody of her with his ex-wife Samantha.Lee Raybon can't stand by when Dale Washberg, the black sheep of a local powerful family, commits suicide under mysterious circumstances.By undertaking to investigate this death, the main character puts himself in serious danger.",
        "rating": 6.9,
        "realiseDate": "2025-09-23T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Biographical",
            "Historical",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/2/k6674929111adbf43d30y.jpg",
        "watchUrl": "https://hdrezka.ag/series/drama/81816-podnogotnaya-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "Marvel Zombies",
        "description": "The story takes place in a dark alternate reality where a mysterious quantum virus has turned most of humanity into zombies, including some supervillains and members of the Avengers team.A small group of survivors, including Kamala Khan, Kate Bishop and Riri Williams, embark on a deadly journey to find a way to defeat the virus.The main characters face off against aggressive hordes of the undead, as well as zombified allies such as Wanda Maximoff, Carol Danvers, Steve Rogers and Clint Barton.",
        "rating": 7.1,
        "realiseDate": "2025-09-24T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Fantasy",
            "Action",
            "Horror",
            "Adventures",
            "Dramas",
            "For adults",
            "Cartoon series",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/4/wbe7f200a20b9sv50e51v.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fiction/81826-zombi-marvel-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "The Fantastic Four: First Steps",
        "description": "Several years have passed since brilliant scientist Reed Richards, his wife Susan Storm, her younger brother Johnny and their close friend Ben Grimm gained superpowers while flying into space.Now forced to protect the planet from all sorts of dangers, they find it difficult to balance their superhero duties and their personal lives, especially Susan, who finds out she is pregnant.The Fantastic Four face an unprecedented threat when Earth is visited by a mysterious alien messenger, the Silver Surfer, who warns of the imminent arrival of his master Galactus, intent on destroying all life.",
        "rating": 7.1,
        "realiseDate": "2025-07-22T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Action",
            "Adventures",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/7/17/k0b2f598c3386vz77k43q.jpg",
        "watchUrl": "https://hdrezka.ag/films/fiction/77270-fantasticheskaya-chetverka-pervye-shagi-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Code 3",
        "description": "The story is about a paramedic who is so exhausted from work that he is forced to quit.However, before that, he must work a final 24-hour shift to train his successor.",
        "rating": 7.2,
        "realiseDate": "2025-09-12T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Action",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/9/a772487cad3bdwk34k98h.jpg",
        "watchUrl": "https://hdrezka.ag/films/comedy/81961-kod-3-2025.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "El refugio atómico",
        "description": "When the world finds itself on the verge of nuclear war, a group of billionaires and their families take refuge in a large underground bunker, where everything is equipped for a long and comfortable stay.This miniature city has a restaurant, a Zen garden, a gym, a cocktail bar, a basketball court and many other amenities, and a live broadcast from the surface allows you to follow the rapid collapse of the old world through monitor screens.Soon the situation in the luxury bunker becomes equally explosive as a long-standing feud between two families flares up.",
        "rating": 5.5,
        "realiseDate": "2025-09-19T00:00:00.000Z",
        "genres": [
            "Thrillers",
            "Dramas",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/2/kbe65edc19db6ya93m55j.jpg",
        "watchUrl": "https://hdrezka.ag/series/thriller/81825-bunker-dlya-bogachey-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "Black Rabbit",
        "description": "Jake Friedken is the owner of the elite New York establishment \"Black Rabbit\", which combines a fashionable restaurant and a venue for VIP events.Suddenly, an older brother named Vince appears, who had previously left the family business due to his addiction to gambling and drugs.The man reluctantly extends a helping hand to his unlucky brother and thereby takes responsibility for all his problems, including a debt to a local loan shark in the amount of 140 thousand dollars.However, problems accumulate one after another and jeopardize everything that Jake has built for many years.",
        "rating": 7.3,
        "realiseDate": "2025-09-18T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Detectives",
            "Thrillers",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/12/n1bac990cde85up70p47i.jpg",
        "watchUrl": "https://hdrezka.ag/series/drama/81620-chernyy-krolik-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "Weapons",
        "description": "In the small town of Maybrook, Pennsylvania, 17 elementary school students in the same class run away from their homes in the middle of the night in an unknown direction and never return.In the morning, only the quiet boy Alex Lilly comes to class, who cannot explain where his classmates have disappeared.The police investigation reaches a dead end, so the parents' anger falls on the young teacher Justine Gandy, who recently headed the ill-fated class.Having become a town outcast, she enlists the help of her ex-boyfriend, police officer Paul Morgan, to find out the truth.",
        "rating": 7.6,
        "realiseDate": "2025-08-06T00:00:00.000Z",
        "genres": [
            "Horror",
            "Detectives",
            "Thrillers",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/9/e2af3d389cbefgn18r46o.jpg",
        "watchUrl": "https://hdrezka.ag/films/horror/79140-orudiya-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Task",
        "description": "In suburban Philadelphia, someone commits a series of particularly brutal drug robberies that could soon spark a gang war.FBI Special Agent Tom Brandis, a former priest who is still in a difficult emotional state due to a family tragedy, is assigned to lead the investigation.Soon the main suspect in all the robberies turns out to be the seemingly ordinary garbage truck driver and single father Robbie Prendergrast, who cares for two small children and his niece Maeve.",
        "rating": 7.7,
        "realiseDate": "2025-09-06T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/4/l09ccff101ffevs87p23z.jpg",
        "watchUrl": "https://hdrezka.ag/series/drama/81843-zadanie-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "Highest 2 Lowest",
        "description": "David King is a music business mega-mogul and founder of Stackin' Hits Records, who lives in a luxurious penthouse in New York City.On the eve of a big financial deal, he receives a call from a mysterious attacker who claims to have kidnapped his teenage son Trey and is demanding a ransom of $17.5 million.David is ready to pay any money, but soon begins to hesitate when it turns out that the criminal has mistakenly taken hostage another child, who is the son of his driver and close friend Paul Christopher.",
        "rating": 5.7,
        "realiseDate": "2025-08-22T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/5/jd6756964d5carb65x54l.jpg",
        "watchUrl": "https://hdrezka.ag/films/drama/79459-ray-i-ad-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Paper",
        "description": "The documentary team that made the Scranton branch of the Dunder Mifflin paper company famous around the world 20 years ago now travels to Toledo, Ohio, to follow the work and personal lives of the editorial staff of The Truth Teller newspaper.The once thriving publishing house is going through hard times: the few remaining employees are lazy and incompetent and share office space with a toilet paper brand.The new energetic editor-in-chief Ned Sampson is taking on the task of reviving the newspaper's former glory.",
        "rating": 7.1,
        "realiseDate": "2025-09-04T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/10/g12df6b2a8945ng37o61u.jpg",
        "watchUrl": "https://hdrezka.ag/series/comedy/81420-gazeta-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "The Naked Gun",
        "description": "Frank Drebin Jr., who has no shortage of courage, followed in the footsteps of his late father, the legendary Los Angeles police officer.Arriving at the scene of a suspicious car accident in which a software developer is killed, Frank teams up with the victim's sister, crime novelist Beth Davenport, to solve the case.During their joint adventures, the two unexpectedly find themselves on the trail of the villain Richard Kane, who is pursuing the goal of gaining control over the consciousness of people around the world.",
        "rating": 6.5,
        "realiseDate": "2025-07-30T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Action",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/7/daa96190e8f48wt48g87w.jpg",
        "watchUrl": "https://hdrezka.ag/films/comedy/79082-golyy-pistolet-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Nobody 2",
        "description": "After his misadventures, once-law-abiding suburban family man Hutch Mansell is forced to return to his job as a hitman to pay off a $30 million debt to a crime syndicate.In an effort to mend his crumbling relationship with his wife and children, a man asks his employer, the Barber, for a short vacation.Hutch takes his family to the Plummerville theme park near the Canadian border, where his hot temper gets him into deadly trouble again.",
        "rating": 6.4,
        "realiseDate": "2025-08-13T00:00:00.000Z",
        "genres": [
            "Action",
            "Thrillers",
            "Comedy",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/11/e1db0eb40d856sp70g42s.jpg",
        "watchUrl": "https://hdrezka.ag/films/action/79600-nikto-2-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Nezha: Mo tong nao hai",
        "description": "The demon boy Nezha and his best friend Ao Bing are two halves of the same elemental energy who defied their destiny, for which they were struck by a heavenly blow and lost their physical bodies.Teacher Taiyi Zhenren prevents the death of their souls by completely depleting the magical power of his Seven-Colored Sacred Lotus.Since due to unforeseen events Ao Bing again loses his bodily shell, he temporarily inhabits Nezha so that together they can go on a dangerous and unpredictable journey in search of a special elixir that can restore the power of the Sacred Lotus.",
        "rating": 8.0,
        "realiseDate": "2025-01-29T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Adventures",
            "Action",
            "Dramas",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/29/j81cd5ad5caaawd22k42g.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fantasy/78445-nechzha-pobezhdaet-carya-drakonov-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Thursday Murder Club",
        "description": "Three best friends live in a luxurious nursing home in the English countryside: retired MI6 agent Elizabeth Best, former trade union leader Ron Ritchie and psychologist Ibrahim Arif, who specializes in working with war veterans.They gather on Thursdays to do their favorite thing - investigating old unsolved crimes.In need of a medical expert, the friends temporarily recruit former nurse Joyce Meadowcroft into their team.When a local real estate developer is found dead, four amateur detectives take on their first real case.",
        "rating": 6.6,
        "realiseDate": "2025-08-22T00:00:00.000Z",
        "genres": [
            "Detectives",
            "Comedy",
            "Thrillers",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/4/s9eb572da018dqt79n82g.jpg",
        "watchUrl": "https://hdrezka.ag/films/detective/81316-klub-ubiystv-po-chetvergam-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Together",
        "description": "Schoolteacher Millie Wilson moves from Melbourne to a quiet country town where she has landed her dream job.The woman is reluctantly accompanied by her boyfriend, aspiring rock musician Tim Brassington, who has become emotionally distant from her after the recent death of her parents.Not far from their new home, during a rainstorm, they fall into an underground cave, where they are forced to spend the whole night.Once outside, Millie and Tim find themselves under the influence of a mysterious supernatural force that causes their bodies to merge into one.",
        "rating": 6.7,
        "realiseDate": "2025-03-07T00:00:00.000Z",
        "genres": [
            "Horror",
            "Fantasy",
            "Melodramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/8/27/ia5f4a11bd6c5og49k98a.jpg",
        "watchUrl": "https://hdrezka.ag/films/horror/79628-odno-celoe-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "F1: The Movie",
        "description": "In the early 1990s, Sonny Hayes was a promising Formula 1 driver, but a serious accident ended his professional career.Since then, the man's life has gone downhill: he has been married three times, acquired a gambling addiction and lives on the verge of bankruptcy, working as a second-rate driver for hire.After once again demonstrating his prowess at the 24 Hours of Daytona, Sonny attracts the attention of old friend Ruben Cervantes, who asks him to join his struggling Formula 1 team.",
        "rating": 7.8,
        "realiseDate": "2025-06-23T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Sports",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/7/7/q2363a1540906kf80d75t.jpg",
        "watchUrl": "https://hdrezka.ag/films/drama/74844-formula-1-2025-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Arcane: League of Legends",
        "description": "The story is based on the League of Legends game universe, which tells the backstory of two city-states - the utopian and prosperous Piltover and the dirty and seedy underground Zaun.The precarious balance of peaceful coexistence is disrupted due to the creation of hextechs in Piltover, allowing any person to control magical energy, while in Zaun a special drug is being invented that turns people into monsters.At the head of the armed confrontation are young heroes, each of whom defends his home.",
        "rating": 9.0,
        "realiseDate": "2021-11-06T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Fantasy",
            "Action",
            "Dramas",
            "Adventures",
            "For adults",
            "Cartoon series",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/11/1/we3930a6c9cf7ff22u16b.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fiction/43477-arkein-2021-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "The Tiger's Apprentice",
        "description": "Tom Lee is a Chinese teenager living in San Francisco.Suddenly, the teenager discovers that he belongs to a legendary line of magical protectors known as the Guardians, and his grandmother is the current guardian of the mysterious phoenix egg.After the tragic death of his grandmother in battle, Tom begins to study ancient magic under the strict guidance of Mr. Hu in order to become the new keeper of the egg.Soon the rat Sydney and the dragon Mistral, who have the ability to take on human form, become members of Tom and Hu's team.A ragtag team of daredevils must engage in a fierce battle with the embittered Lu and her army of demons who are hunting for the egg...",
        "rating": 5.8,
        "realiseDate": "2024-02-02T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Adventures",
            "Action",
            "Comedy",
            "Family",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2024/2/8/ocade907c3736qt45h78r.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fantasy/66931-uchenik-tigra-2024.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Mononoke-hime",
        "description": "The plot takes place in medieval Japan, when firearms first began to appear there.A village inhabited by people of the Emishi ethnic group is attacked by a huge boar, called Nago by the locals.The young prince Ashitaka comes to the defense of the population, and with great difficulty, he still manages to defeat the monster.However, during a fierce fight, the boar manages to wound the prince, and thereby transfer his curse to him.A local healer predicts Ashitaka's death from his wound, but at the same time, she tells the prince that he has the power to change his fate.The brave young man has no choice but to go on a journey and try to find a remedy that can save him from the curse.",
        "rating": 8.3,
        "realiseDate": "1997-07-12T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Fantasy",
            "Adventures"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2022/11/15/dda8540e7f147ul10p17p.jpg",
        "watchUrl": "https://hdrezka.ag/animation/drama/1350-princessa-mononoke-1997-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Sen to Chihiro no kamikakushi",
        "description": "The adventure anime cartoon “Spirited Away” tells the story of a ten-year-old girl named Chihiro Ogino, who, by the will of fate, was destined to find herself in a world of ghosts and monsters.While moving to a new place of residence, Chihiro and his parents find themselves in a deserted town.In one of the empty buildings there turns out to be a restaurant in which the tables are simply bursting with various foods.The girl's parents decide to try the goodies, and after a while they turn into pigs.As it soon turns out, the family was captured by an evil witch, ruler of the world of gods and spirits.Now Chihiro has to find a way to disenchant his parents, and most importantly, how to get out of the kingdom of ghosts.",
        "rating": 8.6,
        "realiseDate": "2001-07-20T00:00:00.000Z",
        "genres": [
            "Adventures",
            "Fantasy",
            "Dramas"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2024/6/1/y0f1cfad8047bss13w46p.jpg",
        "watchUrl": "https://hdrezka.ag/animation/adventures/829-unesennye-prizrakami-2001.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Hauru no ugoku shiro",
        "description": "When the charming Sophie Hatter was cursed by a treacherous witch and imprisoned in the body of an old woman, she, embarrassed by her own appearance, went to wander the hills, where she found a magical castle.The owner of the moving castle turns out to be the charming wizard Howl, who has a bad reputation, and whose personal demon Calcifer is in his service.Soon, having become friends, Sophie and Calcifer enter into a pact: the demon promises to help the girl get rid of the curse, and she must find a way to free him from the power of Howl, who has begun to suspect something is wrong...",
        "rating": 8.2,
        "realiseDate": "2004-11-20T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Adventures",
            "Romantic",
            "Fairy tales"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2013/12/6/ef77d254dc1e2cr71n96w.jpg",
        "watchUrl": "https://hdrezka.ag/animation/drama/818-hodyachiy-zamok-2004.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Kimitachi wa Dou Ikiru ka",
        "description": "The boy Mahito's mother dies in the Tokyo bombings.The father takes the boy from the city and decides to live with a pregnant relative in the countryside.Mahito is trying to cope with a personal tragedy and get used to his new surroundings.One day he meets a talking heron, who promises him a meeting with his mother if they go to a nearby abandoned mansion.",
        "rating": 7.4,
        "realiseDate": "2023-07-14T00:00:00.000Z",
        "genres": [
            "Adventures",
            "Dramas",
            "Fantasy"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2023/10/5/ff77fb618bae1td31h41k.jpg",
        "watchUrl": "https://hdrezka.ag/animation/adventures/60358-malchik-i-ptica-2023.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Spider-Man: Across the Spider-Verse",
        "description": "Gwen Stacy joins Miguel O'Hara's elite team of Spider-Men and helps defend the multiverse from dangerous threats and anomalies.One of the assignments brings Gwen to Earth, where the matured Miles Morales is trying to balance between the responsibilities of a responsible son and a friendly Spider-Man.Stacy's visit baffles Morales, who is forced to use his personal stealth skills to travel with her to an alternate Earth where Spider-Man India faces off against the treacherous supervillain scientist The Blur.",
        "rating": 8.5,
        "realiseDate": "2023-05-31T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Fantasy",
            "Action",
            "Adventures",
            "Comedy",
            "Family",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2023/6/4/i0d12caa69e1evl65h64s.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fiction/57261-spider-man-pautina-vselennyh-part-1-2023-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Legend of Muay Thai: 9 Satra",
        "description": "Once upon a time, the kingdom of Rampthep was a great empire, where peace and prosperity reigned, until one day the evil Yakshi tribe invaded foreign lands.Having captured Ramptep, the Yakshi imprisoned the ruler's family, and then began to sow death and destruction throughout the kingdom.For many years, people suffered from the actions of demons until there was hope for salvation - a boy who could free Rampthep from the power of darkness with the help of a sacred weapon known as the “stone of the nine gods.”A young warrior, Ott, trained in the art of Muay Thai, is tasked with delivering this weapon to the king's heir who can save his people, but to do this he will have to go on a journey filled with many dangers and trials.",
        "rating": 7.3,
        "realiseDate": "2018-01-11T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Action",
            "Adventures",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2019/2/6/fd00711fe27ccia16n27j.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fantasy/29798-sila-devyati-bogov-2018.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Bai she: yuan qi",
        "description": "Five centuries ago, a powerful general ordered the destruction of all snakes in China, but his plans must be destroyed by the White Snake.When the White Snake fails an important mission, she miraculously survives, using a magical hairpin received as a gift from her mother.From this moment on, the main character is forced to live in the human world in the form of an ordinary girl, completely losing her memories.However, a mysterious jade hairpin forces the White Snake to go on an adventure to regain her memories...",
        "rating": 7.0,
        "realiseDate": "2019-01-11T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Adventures",
            "Action",
            "Melodrama",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/10/28/cc35b05c51a57fb98x45s.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fantasy/44505-belaya-zmeya-2019.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Boy, the Mole, the Fox and the Horse",
        "description": "One day, a little boy embarks on a deadly journey across a snowy landscape to find the way to his home.Soon the boy accidentally encounters a cute mole, who decides to become the boy's companion in this spontaneous adventure.While making their way through picturesque areas, a couple of friends notice that they are being chased by a fox, and then fate brings the main characters together with a beautiful and majestic horse.Deciding to unite, they go to a distant region to help the boy find his home...",
        "rating": 7.8,
        "realiseDate": "2022-09-23T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Family",
            "Short films",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2022/12/26/hc49ab48bb81bhv18h62z.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fantasy/53981-malchik-krot-lis-i-loshad-2022.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Rango",
        "description": "A chameleon named Rango spent his entire life in a terrarium.But he always dreamed of adventure and becoming a hero.One day, when his owners were moving, the terrarium fell out along the way and Rango found himself free.Fate gives him a chance to make his dreams come true.He finds himself in a deserted town, where complete confusion reigns.Thanks to a coincidence of circumstances, Rango becomes the sheriff of this town.But as soon as he began to defend law and order, various troubles began to occur in the city.However, thanks to his courage and fearlessness, he is able to cope with everything!",
        "rating": 7.3,
        "realiseDate": "2011-02-14T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Adventures",
            "Westerns",
            "Family",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/4/2/sed3fdf7def23cw16e50p.jpeg",
        "watchUrl": "https://hdrezka.ag/cartoons/comedy/280-rango-2011.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Legend of the Guardians: The Owls of Ga’Hoole",
        "description": "The story centers on the owl Soren, who loves the tales his father tells about the legendary night guards who protect the kingdom of owls from various dangers, although his brother Kludd believes that these stories are fiction.One day, Soren and Kludd fall out of the nest while learning to fly on their own, after which the brothers are kidnapped by treacherous and evil owls to force them to work for the benefit of the embittered Metal Beak.After befriending the elf owl Gylfi, the brothers learn to fly and fight, discover that the night guards actually exist, and then come into conflict with Metal Beak and his cohorts...",
        "rating": 6.9,
        "realiseDate": "2010-09-23T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Action",
            "Adventures",
            "Family",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2014/12/19/e5b04a4643da0tx61b31q.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fantasy/6056-legendy-nochnyh-strazhey-2010.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Cars",
        "description": "An adventure and comedy cartoon directed by John Lasseter from the Pixar studio about talking cars.The main character of the cartoon is a racing car named Lightning McQueen.He always loves to win, and at the moment his dream is to win the famous Piston Cup competition.However, on the way there, the hero finds himself lost on Route 66, which leads him after long wanderings to the long-abandoned city of Radiator Springs.Not only does Lightning McQueen get lost, but he also manages to ruin the only road in this city, after which he is sent to correctional labor.As he spends his time in Radiator Springs, McQueen becomes close to the locals, and even makes new friends who become his race team and help him realize the meaning of life.",
        "rating": 7.3,
        "realiseDate": "2006-03-14T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Adventures",
            "Sports",
            "Family",
            "Children's",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/3/5/uc342cfaedfc3tp28d72i.jpeg",
        "watchUrl": "https://hdrezka.ag/cartoons/comedy/348-tachki-2006.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Brave",
        "description": "Red-haired Princess Merida is a brave girl from harsh Scotland who prefers to improve her archery and horse riding skills rather than do needlework.Possessing a rebellious and stubborn character, Merida does not approve of her mother's countless attempts to arrange an engagement for her.One day, angry at her mother’s next liberties, the heroine leaves her native castle, and then finds herself in an enchanted forest, which is the abode of a powerful witch.It is here that Merida hopes to find a remedy that will save her from all her problems, but the girl’s reckless act threatens to turn into a real tragedy for the entire princess’s family...",
        "rating": 7.1,
        "realiseDate": "2012-06-10T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Comedy",
            "Adventures",
            "Family",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/5/27/y7050d3aa899btp45j42k.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/fantasy/175-hrabraya-serdcem-2012.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Cars 2",
        "description": "A very funny adventure cartoon from the Walt Disney Pictures studio telling about the life of the world of talking cars.The plot centers on two old friends, Lightning McQueen and Mater, who are going to the most famous and prestigious race, the World Grand Prix, which will take place in several countries at once.This competition will determine the best driver on the planet, and McQueen has every chance of becoming one.However, in the midst of the competition, secret agents turn to him for help, and he and his best friend find themselves drawn into the world of Walt Disney espionage.",
        "rating": 6.2,
        "realiseDate": "2011-06-18T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Adventures",
            "Sports",
            "Family",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/3/5/y17994022a20eyf27f97p.jpeg",
        "watchUrl": "https://hdrezka.ag/cartoons/comedy/347-tachki-2-2011.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Cars 3",
        "description": "At the center of the events is the main character, whose name is Lightning McQueen - a racing car that is going through hard times.Behind the back of a cool car are hundreds of miles conquered at breakneck speed, endless victories and the taking of any peaks.But fame and recognition now come to our hero only in dreams.After all, the modern world is changing every day, and the world of racing does not stand still either.A new generation of ultra-modern cars is beginning to displace outdated models, taking prizes.However, McQueen has no intention of living out his last days in oblivion.Instead of despairing, he asks for help from the young and incredibly talented Cruz Ramirez...",
        "rating": 6.7,
        "realiseDate": "2017-06-10T00:00:00.000Z",
        "genres": [
            "Comedy",
            "Adventures",
            "Sports",
            "Family",
            "Children's",
            "Full-length",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/1/18/w880bff4ea847nj93k11s.jpg",
        "watchUrl": "https://hdrezka.ag/cartoons/comedy/23883-tachki-3-2017.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Revolver",
        "description": "Jack Green spent seven years in solitary confinement.All because Jack accidentally got into a very unpleasant situation.At that time, the illegal gambling business was in full bloom in the city, and the crime boss Mac was in charge of it all.One day, on the eve of a very big game, he lost his man, whom he decided to replace with Jack.But the hero refused to participate in the game, and then they decided to put pressure on Green with the help of his brother’s family.In light of the current situation, Jack had no choice but to agree to Mac's proposal.Being an experienced player, he managed to win, but nothing ended there...",
        "rating": 6.3,
        "realiseDate": "2005-09-11T00:00:00.000Z",
        "genres": [
            "Detectives",
            "Crime",
            "Dramas",
            "Thrillers",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2022/4/14/t20f30b74dd11db55e34k.jpeg",
        "watchUrl": "https://hdrezka.ag/films/detective/1567-revolver-2005-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Bar \"One call\"",
        "description": "Investigator Andrei Morozov is searching for the missing son of his wife, who lies in a coma.All the evidence leads to the mysterious “One Call” bar, which either disappears or appears in different places, leaving behind the bodies of the dead.The establishment is run by a bartender who not only mixes cocktails and makes cynical remarks, but also helps visitors call the dead.Different people come to the establishment with their own problems: the beautiful Zhanna, who wants to get rid of her wealthy husband;lawyer Max, who with age never managed to separate from his mother;blogger Sam, who has yet to understand what he has to do with the other world.",
        "rating": 6.5,
        "realiseDate": "2025-10-01T00:00:00.000Z",
        "genres": [
            "Thrillers",
            "Detectives",
            "Fantasy",
            "Russians"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/29/k40d5492dbaffnj36k22t.jpg",
        "watchUrl": "https://hdrezka.ag/series/thriller/82469-bar-odin-zvonok-2025.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "Prisoner of War",
        "description": "A British SAS officer during World War II is captured and forced to fight in a Japanese internment camp.",
        "rating": 6.4,
        "realiseDate": "2025-04-03T00:00:00.000Z",
        "genres": [
            "Action",
            "Thrillers",
            "Military",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/21/ra0c94b2a77fbfb20x94s.jpg",
        "watchUrl": "https://hdrezka.ag/films/action/82260-voennoplennyy-2025.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Tomorrow People",
        "description": "The story follows Steven Jameson, a teenager suffering from symptoms of schizophrenia and a mysterious sleep disorder that causes him to wake up in various places with no memory of how he ended up there.As the mysterious voice in his head grows louder, Steven follows its instructions to meet Kara, who tells him that he belongs to the Future People, a highly advanced race with the powers of telekinesis, teleportation and telepathy.Before Steven can learn more about his race, he is kidnapped by a government agency tasked with neutralizing the threat posed by the people of the future...",
        "rating": 7.1,
        "realiseDate": "2013-10-09T00:00:00.000Z",
        "genres": [
            "Action",
            "Fantasy",
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2015/11/11/ke7800dc21eccxu10r26p.jpg",
        "watchUrl": "https://hdrezka.ag/series/action/11208-lyudi-buduschego-2013.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "The Encounter",
        "description": "Dramatic action-packed film from American director David E.R. White.Five strangers live in sunny California.Nick is a former NFL player and owner of a chain of restaurants offering customers the fast food variety of hamburgers.Hank and Katherine are a married couple on the verge of divorce.Melissa is a longtime Christian who is dating an atheist guy.Kayla is a girl hitchhiking to escape the harsh conditions of life in Los Angeles.When the bypass road closes, the film's characters stop at a non-existent but functioning cafe-eatery.Its omnipresent and permanent owner is Jesus.Not real, probably, but pretending to be one.A rather strange and mysterious man is trying to help each of the visitors find out the real truth about his life (especially its dark side), achieve repentance and reconciliation.Thanks to the man, Carla finally found the strength to forgive her stepfather who insulted and offended her.Hank and Katherine work to repair their fractured marriage, while Melissa strengthens her relationship with her boyfriend of a different faith.Proud, narcissistic and selfish, Nick also undergoes moral rehabilitation and completely reconsiders his life.Suddenly, police officer Deville interrupts the holy idyll and informs everyone that the road is open again.It soon turns out that a policeman with that name does not exist, since he is a real devil in disguise in human incarnation.",
        "rating": 6.7,
        "realiseDate": "2011-05-03T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2016/4/22/a2d6ca599d6d8dh95w76g.jpg",
        "watchUrl": "https://hdrezka.ag/films/drama/13193-neozhidannaya-vstrecha-2010.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Land of Bad",
        "description": "Young Sergeant JJ ​​\"Playboy\" Kinney is recruited for a dangerous mission: he must go into the jungles of the Philippines as part of a team to rescue a CIA agent captured by terrorists.Together with Kinney, Sweet, Abell and Bishop are sent to the territory of the Philippines, and drone pilots Grimm and Branson become their “eyes in the sky” and provide missile support.The mission doesn't go according to plan, and Kinney finds himself completely alone in enemy territory.Crossing unfamiliar terrain under the strict guidance of Grimm's drone, the sergeant faces mortal danger...",
        "rating": 6.6,
        "realiseDate": "2024-01-25T00:00:00.000Z",
        "genres": [
            "Action",
            "Thrillers",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2024/2/19/c5a0a035a3b2bgo62o96c.jpg",
        "watchUrl": "https://hdrezka.ag/films/action/67402-territoriya-zla-2024.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Seven Pounds",
        "description": "Sometimes, due to the fault of some people, others die.And while some of them then live as if nothing had happened, others cannot forgive themselves for the rest of their lives.This happened with the main character of the dramatic film “Seven Lives” - Ben Thomas.One day, distracted from the road, Ben causes a car accident that kills seven people, including his beloved Sarah Johnson.Ben himself manages to survive, but the feeling of guilt and unbearable pain from the tragedy that occurred does not leave him.A few years after the accident, he leaves his job and makes an attempt to somehow atone for his guilt.Ben finds seven people who are sick and need help...",
        "rating": 7.6,
        "realiseDate": "2008-12-19T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2013/11/28/s989e26ab5ef8zn10s75h.jpg",
        "watchUrl": "https://hdrezka.ag/films/drama/786-sem-zhizney-2008.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Trouble with the Curve",
        "description": "This is a sports drama in which you will see an unusual tandem - the wonderful actor Clint Eastwood, known to all of us, and the young but already very popular singer Justin Timberlake.Gus Lobel is a legendary coach who dedicated his entire life to baseball.He is already very old and cannot be a team coach.He loses his sight, and Miki's daughter is very worried about her father.She, risking her career, comes to him to support and help in his work.Together with Johnny, a former baseball player turned baseball scout, they travel all over the country in search of young stars.",
        "rating": 6.8,
        "realiseDate": "2012-09-19T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Sports",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2013/7/16/f06b771636f9exj45r44x.jpg",
        "watchUrl": "https://hdrezka.ag/films/drama/209-kruchenyy-myach-2012.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "House of David",
        "description": "Around the 11th century BC.Saul managed to unite the divided Jewish people and create the Kingdom of Israel.Years later, the king became estranged from God, became disheartened, and began a bitter war against the Philistines.At the behest of the Almighty, the prophet Samuel makes the young and timid David, the illegitimate son of the shepherd Jesse from Bethlehem, the new anointed king.Before forcing Saul to relinquish his throne, David must overcome many challenges, including defeating the giant Philistine warrior Goliath in battle.",
        "rating": 7.4,
        "realiseDate": "2025-02-27T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Historical",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2025/9/19/t0b6955be7c0dck87t28z.jpg",
        "watchUrl": "https://hdrezka.ag/series/drama/77276-dom-davida-2025-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "The Accountant",
        "description": "The action of the fascinating film revolves around Christian Wulff, a mathematical genius with pronounced analytical skills.From early childhood, despised by his peers because he was not like everyone else, the guy grew up surrounded by endless numbers and mathematical formulas, which became closer to him than people.Growing up, Christian began secretly working as an auditor, providing his highly qualified services to incredibly dangerous criminal organizations.Soon our hero notices that he is being closely watched by the department dedicated to combating economic crimes, headed by Ray King, after which Christian suspends work with criminals and finds himself an official law-abiding client, which turns out to be a large corporation for the production of cutting-edge robotics, where an employee of the financial department found discrepancies of several million dollars.But as soon as our hero, with his inherent responsibility, got down to work and delved into financial statements, the first victims began to appear in a strange case related to financial fraud.",
        "rating": 7.3,
        "realiseDate": "2016-10-10T00:00:00.000Z",
        "genres": [
            "Action",
            "Thrillers",
            "Dramas",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2024/12/16/y3cd8b4fb2237fq13b53l.jpg",
        "watchUrl": "https://hdrezka.ag/films/action/14521-rasplata-2016-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "The Wheel of Time",
        "description": "At the center of the story is Moiraine Damodred, a member of the powerful female order of sorceresses Aes Sedai, searching for the reincarnation of the mythical hero - the Dragon Reborn, who was prophesied to save the world or destroy it.She arrives in a small village called Dvurechye, where she takes under her protection three young men and a girl, among whom there should be that same messiah, who has no idea of ​​his destiny.Together they set off on a long and dangerous journey to fight the Dark One himself at the end of the journey...",
        "rating": 7.2,
        "realiseDate": "2021-11-19T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Adventures",
            "Action",
            "Dramas",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/10/28/xc55724289f41fj48a29i.jpg",
        "watchUrl": "https://hdrezka.ag/series/fantasy/43348-koleso-vremeni-2021-latest.html",
        "type": 1,
        "seasons": 1,
        "episodes": 8
    },
    {
        "title": "The Shawshank Redemption",
        "description": "The cult drama is based on Stephen King's story \"Rita Hayworth of Shawshank\".The film takes place in the late 50s of the last century.Young financier Andy Dufresne is sentenced to life imprisonment for double murder, but he categorically denies his involvement in the crime.Andy is sent to serve his sentence in one of the most famous prisons - Shawshank, from which no one has ever managed to escape.In prison, the guy is faced with the harsh realities of the prison world, a world where there is no place for compassion, and only cruelty around.Andy repeatedly becomes a victim of sexual harassment, but he resists to the last.Soon, Dufresne's prison life gets a little better, and he even finds a friend, who becomes a black prisoner Red...",
        "rating": 9.3,
        "realiseDate": "1994-09-13T00:00:00.000Z",
        "genres": [
            "Dramas",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2021/3/6/fbed3510b213eji29i54b.jpeg",
        "watchUrl": "https://hdrezka.ag/films/drama/806-pobeg-iz-shoushenka-1994-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Money Electric: The Bitcoin Mystery",
        "description": "Cullen Hoback explores the origins of Bitcoin and its anonymous creator Satoshi Nakamoto, looking at the cryptocurrency's potential in the global financial system and who could wield enormous power if it goes mainstream.",
        "rating": 6.8,
        "realiseDate": "2024-10-08T00:00:00.000Z",
        "genres": [
            "Documentary",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2024/10/14/e71b560db07b1vu85t23b.jpg",
        "watchUrl": "https://hdrezka.ag/films/documentary/74412-kriptovalyuta-tayna-bitkoina-2024.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Le comte de Monte-Cristo",
        "description": "Having become the victim of an insidious conspiracy, young Edmond Dantes was arrested on his wedding day for a crime he did not commit.After 14 years in prison at the Chateau d'If, he finally manages to escape.On the mysterious island, which his friend Abbot Faria told him about in prison, Edmond finds a legendary treasure and becomes the Count of Monte Cristo.Now his only goal is revenge.",
        "rating": 7.6,
        "realiseDate": "2024-06-28T00:00:00.000Z",
        "genres": [
            "Adventures",
            "Dramas",
            "Thrillers",
            "Action",
            "Melodramas",
            "Historical",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2024/9/10/e1b1329f3e7a2xh40x43q.jpg",
        "watchUrl": "https://hdrezka.ag/films/adventures/73579-graf-monte-kristo-2024-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Pearl Harbor",
        "description": "The film \"Pearl Harbor\" tells the story of the friendship of two friends - Rafe and Danny, who grew up and strived for a single dream, helping each other.They want to become pilots as children, and when they grow up they become pilots.They both meet a beautiful girl and fall in love with her.Rafe wins the heart of a young girl, Evelyn, who works as a nurse, but the lovers' happiness is cut short when she learns that Rafe died in flight fighting off raids by German troops.Events unfold in such a way that the unfortunate Evelyn and Danny, having lost their best friend and the love of their lives, begin to seek solace in each other.Over time, they fall in love, but fate played a cruel joke on them again, because Rafe returned, it turned out that he survived that terrible flight and was saved.Rafe finds out what happened while he was away from Pearl Harbor.A violent conflict arises between friends and former friends have to flee from the police.At the same time, the Japanese are collecting data and developing a plan of action to attack the American sailors, catching them by surprise.As a result, many people die, Evelyn is left to help the wounded, and Rafe and Denny enroll as Dolittle pilots.It’s worth finding out how the characters’ events will unfold in the future by watching an incredibly exciting movie with a plot.",
        "rating": 6.3,
        "realiseDate": "2001-05-21T00:00:00.000Z",
        "genres": [
            "Action",
            "Military",
            "Dramas",
            "Melodrama",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2014/12/19/c01dd66c2e64dvo25g91n.jpg",
        "watchUrl": "https://hdrezka.ag/films/action/5700-perl-harbor-2001.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Arthur the King",
        "description": "American runner Michael Light, who has devoted 20 years of his life to participating in so-called “adventure races,” is having difficulty finding sponsors for a new race, since he has never been able to win in his career due to his stubborn nature and bad decisions at crucial moments.He and three teammates fly to the Dominican Republic, determined to finish first in a 700-kilometer race through mountainous jungle terrain at all costs.During the grueling race, Michael meets a stray dog ​​named Arthur, who becomes the fifth member of the team and a good luck charm.",
        "rating": 7.0,
        "realiseDate": "2024-02-22T00:00:00.000Z",
        "genres": [
            "Adventures",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2024/3/31/e2d682e142c6dlb16i35n.jpg",
        "watchUrl": "https://hdrezka.ag/films/adventures/68871-artur-ty-korol-2024.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "57 Seconds",
        "description": "Franklin Fox is a talented blogger with a passion for modern technology.He gets a rare opportunity to interview technological genius and innovator Anthony Burrell after the guy manages to save his life.After a candid dialogue with a successful industry guru, the blogger discovers a special ring left behind by Burrell, which has the ability to transport a person back in time for 57 seconds.Franklin decides to use the find not only to improve his romantic relationship with his girlfriend, but also to take revenge on the head of the pharmaceutical corporation that created the drug that caused the death of the guy's sister.",
        "rating": 5.4,
        "realiseDate": "2023-09-29T00:00:00.000Z",
        "genres": [
            "Fantasy",
            "Thrillers",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2023/10/1/h5b0a7ef14dcfuo43a41r.jpg",
        "watchUrl": "https://hdrezka.ag/films/fiction/62227-57-sekund-2023.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    },
    {
        "title": "Guy Ritchie's The Covenant",
        "description": "During the war in Afghanistan, Marine John Kinley recruits Ahmed, a local man who despises the Taliban for killing his son, as a translator.When Kinley and his squad are ambushed and seriously wounded, the translator takes great risks and titanic efforts to save him.After the US Army evacuates from Afghanistan, Ahmed is denied a visa, leaving him and his family to fend for themselves.A sense of duty prompts the protagonist to return alone to the combat zone to save his comrade.",
        "rating": 7.5,
        "realiseDate": "2023-04-19T00:00:00.000Z",
        "genres": [
            "Action",
            "Thrillers",
            "Crime",
            "Foreign"
        ],
        "posterUrl": "https://static.hdrezka.ac/i/2023/4/16/g64207439e76fhf15l98l.jpg",
        "watchUrl": "https://hdrezka.ag/films/action/56708-perevodchik-2023-latest.html",
        "type": 0,
        "seasons": 0,
        "episodes": 0
    }
]